app/views/users/index.html.erb

      <td><%= user.email %></td>
      <td><%= Business.where(user_id: user.id).count %></td>
---
SELECT  "businesses".* FROM "businesses" WHERE "businesses"."user_id" = $1 LIMIT 1  [["user_id", 1]]
SELECT COUNT(*) FROM "businesses" WHERE "businesses"."user_id" = $1  [["user_id", 4]]