app/views/items/_form.html.erb

SELECT "businesses"."name", "businesses"."id" FROM "businesses"
---
  <%= f.label :business_id %>
  <%= f.collection_select :business_id, Business.all, :id, :name, {prompt: 'Select a business'}, {class: 'form-control'} %>