app/controllers/business_controller.rb

  def index
    @businesses = Business.where(user_id: current_user.id)
---
SELECT "businesses".* FROM "businesses" WHERE "businesses"."user_id" = $1  [["user_id", 3]]

  def create
    @business = Business.new(businesses_params)
    @business.user_id = current_user.id

    respond_to do |format|
      if @business.save
---
INSERT INTO "businesses" ("name", "address", "city", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    respond_to do |format|
      if @business.update(businesses_params)
---
UPDATE "businesses" SET "address" = $1, "updated_at" = $2 WHERE "businesses"."id" = $3  [["address", "Teste Address 123"], ["updated_at", "2020-06-11 02:58:59.692152"], ["id", 3]]

  def destroy
    @business.destroy
---
DELETE FROM "businesses" WHERE "businesses"."id" = $1  [["id", 4]]

  def set_business
    @business = Business.find(params[:id])
---
SELECT  "businesses".* FROM "businesses" WHERE "businesses"."id" = $1 LIMIT 1  [["id", 4]]