app/controllers/items_controller.rb

  def create
    @items = Item.new(items_params)
    @items.business_id = current_business.id

    respond_to do |format|
      if @items.save
---
INSERT INTO "items" ("name", "price", "business_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Guilherme Teste"], ["price", 12341], ["business_id", 2], ["created_at", "2020-06-11 01:22:40.417023"], ["updated_at", "2020-06-11 01:22:40.417023"]]

  def update
    # TODO: [TAKI-001] Finish the implementation of Create/Update/Delete for Items

    respond_to do |format|
      if @items.update(items_params)
---
UPDATE "items" SET "business_id" = $1, "updated_at" = $2 WHERE "items"."id" = $3  [["business_id", 1], ["updated_at", "2020-06-11 02:01:08.416987"], ["id", 6]]

  def destroy
    # TODO: [TAKI-001] Finish the implementation of Create/Update/Delete for Items

    # It is not recommended to destroy data ;)
    @items.destroy
---
DELETE FROM "items" WHERE "items"."id" = $1  [["id", 11]]

  def set_items
    @items = Item.find(params[:id])
---
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", 11]]